app/Controllers/ClientesController.php

    public function index(): string
    {
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->findAll();
---
SELECT *
FROM `clientes`

    public function eliminarClientes($id = null)
    {

        $clientes = new clientesModel();
        $clientes->delete([$id]);
---
DELETE FROM `clientes`
WHERE `cliente_id` IN ('4')