app/Controllers/ReservacionesController.php

    public function index(): string
    {
        $reservacion = new ReservacionesModel();
        $datos['datos']=$reservacion->findAll();
---
SELECT *
FROM `reservaciones`

    public function eliminarReservaciones($id = null)
    {
        $reservacion = new ReservacionesModel();
        $reservacion->delete([$id]);
---
DELETE FROM `reservaciones`
WHERE `reservacion_id` IN ('7')

    public function buscarReservaciones($reservacion_id = null)
    {
        $reservacion = new ReservacionesModel();
        $datos['datos']=$reservacion->where('reservacion_id',$reservacion_id)->first();
---
SELECT *
FROM `reservaciones`
WHERE `reservacion_id` IS NULL
 LIMIT 1

    public function agregarReservacion()
    {
        $reservacionid = $this->request->getVar('txtReservacionId');
        $fecha = $this->request->getVar('txtFecha');
        $clienteid = $this->request->getVar('txtClienteId');
        $hotelid = $this->request->getVar('txtHotelId');
        $descripcion = $this->request->getVar('txtDescripcion');
        $usuarioid = $this->request->getVar('txtUsuarioId');

        $reservacion = new ReservacionesModel();

        $datos=[
            'reservacion_id' => $reservacionid,
            'fecha' => $fecha,
            'cliente_id' => $clienteid,
            'hotel_id' => $hotelid,
            'descripcion' => $descripcion,
            'usuario_id' => $usuarioid
        ];

        $reservacion->insert($datos);
---
INSERT INTO `reservaciones` (`reservacion_id`, `fecha`, `cliente_id`, `hotel_id`, `descripcion`, `usuario_id`) VALUES ('201', '2024-08-06', '777', '33', '2 personas', '200')